
## Plan Result (prod)




<pre><code>Plan: 0 to add, 8 to change, 0 to destroy.</code></pre>

* Update
  * module.elastic.azurerm_network_security_rule.aks_rule
  * module.elastic.azurerm_network_security_rule.apps_rule
  * module.elastic.azurerm_network_security_rule.jenkins_rule
  * module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0]
  * module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0]
  * module.elastic.azurerm_resource_group.elastic-resourcegroup
  * module.elastic.azurerm_template_deployment.elastic-iaas
  * module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elastic.data.azurerm_application_security_group.data_asg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "data_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-data-asg"
      + resource_group_name = "ccd-elastic-search-prod"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_application_security_group.kibana_asg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_application_security_group" "kibana_asg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-asg"
      + resource_group_name = "ccd-elastic-search-prod"
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.cluster_nsg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "cluster_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-cluster-nsg"
      + resource_group_name = "ccd-elastic-search-prod"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.data.azurerm_network_security_group.kibana_nsg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "kibana_nsg" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ccd-kibana-nsg"
      + resource_group_name = "ccd-elastic-search-prod"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.elastic.azurerm_network_security_rule.aks_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "aks_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/AKS_To_ES"
        name                                       = "AKS_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.apps_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "apps_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/App_To_ES"
        name                                       = "App_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.jenkins_rule will be updated in-place
  ~ resource "azurerm_network_security_rule" "jenkins_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-data-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-cluster-nsg/securityRules/Jenkins_To_ES"
        name                                       = "Jenkins_To_ES"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_kibana_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_kibana_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_Kibana"
        name                                       = "Bastion_only_Kibana"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_network_security_rule.kibana_tight_ssh_rule[0] will be updated in-place
  ~ resource "azurerm_network_security_rule" "kibana_tight_ssh_rule" {
      ~ destination_application_security_group_ids = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/applicationSecurityGroups/ccd-kibana-asg",
        ] -> (known after apply)
        id                                         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Network/networkSecurityGroups/ccd-kibana-nsg/securityRules/Bastion_only_SSH"
        name                                       = "Bastion_only_SSH"
        # (16 unchanged attributes hidden)
    }

  # module.elastic.azurerm_resource_group.elastic-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "elastic-resourcegroup" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod"
        name       = "ccd-elastic-search-prod"
      ~ tags       = {
          - "application"         = "core-case-data"
          - "builtFrom"           = "https://github.com/HMCTS/ccd-elastic-search.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ccd-community"
          - "environment"         = "production"
          - "lastUpdated"         = "2024-05-17T15:37:19Z"
          - "managedBy"           = "CCD"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.elastic.azurerm_template_deployment.elastic-iaas will be updated in-place
  ~ resource "azurerm_template_deployment" "elastic-iaas" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-elastic-search-prod/providers/Microsoft.Resources/deployments/ccd-elastic-search-prod"
        name                = "ccd-elastic-search-prod"
      ~ parameters          = {
          ~ "_artifactsLocation"               = "https://raw.githubusercontent.com/hmcts/azure-marketplace/7.11.1_hmcts/src/" -> "https://raw.githubusercontent.com/hmcts/azure-marketplace/DTSPO-17635_7.11.1/src/"
          + "dataStorageAccountType"           = "Standard"
            # (36 unchanged elements hidden)
        }
      ~ template_body       = jsonencode(
          ~ {
              ~ parameters     = {
                  + dataStorageAccountType                = {
                      + allowedValues = [
                          + "Default",
                          + "Standard",
                        ]
                      + defaultValue  = "Default"
                      + metadata      = {
                          + description = "The storage account type of the attached managed disks (Default or Standard). The Default storage account type will be Premium Storage for VMs that support Premium Storage and Standard HDD Storage for those that do not."
                        }
                      + type          = "string"
                    }
                  ~ storageAccountType                    = {
                      ~ metadata      = {
                          ~ description = "The storage account type of the attached managed disks and OS disks (Default or Standard). The Default storage account type will be Premium Storage for VMs that support Premium Storage and Standard HDD Storage for those that do not." -> "The storage account type of the attached OS disks (Default or Standard). The Default storage account type will be Premium Storage for VMs that support Premium Storage and Standard HDD Storage for those that do not."
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (84 unchanged attributes hidden)
                }
              ~ variables      = {
                  + dataResolvedStorageAccountType   = "[variables('storageAccountOverrides')[parameters('dataStorageAccountType')]]"
                  ~ storageAccountOverrides          = {
                      ~ Standard = "Standard_LRS" -> "StandardSSD_LRS"
                        # (1 unchanged attribute hidden)
                    }
                  ~ topologySettings                 = {
                      ~ dataNodeStorageSettings           = {
                          + dataAccountType = "[variables('dataResolvedStorageAccountType')]"
                            # (3 unchanged attributes hidden)
                        }
                        # (32 unchanged attributes hidden)
                    }
                    # (34 unchanged attributes hidden)
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.elastic.module.elastic_action_group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.Resources/deployments/es-ccd"
        name                     = "es-ccd"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 8 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":79,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->